export const requeredError = "Поле обязательно для заполнения";
export const loginError = `Логин может быть от 3 до 20 символов, 
латиница, может содержать цифры, но не состоять из них, 
без пробелов, без спецсимволов (допустимы дефис и нижнее подчёркивание).`;
export const nameError = `Первая буква должна быть заглавной, 
  без пробелов и без цифр (допустим только дефис)`;
export const passwordError = `Пароль должен содержать от 8 до 40 символов, 
обязательно хотя бы одна заглавная буква и цифра`;
export const emailError = `Email может включать цифры и спецсимволы вроде дефиса, 
обязательно должна быть «собака» (@) и точка после неё, 
но перед точкой обязательно должны быть буквы`;
export const phoneError = `Телефон должен состоять из цифр, 
может начинается с плюса`;
